[     
    {
    "articleId": 15,
    "articleTitle": "GUEST ARTICLE -15 (THOUGHTS BY Ms. JERINA JOY)",
    "date":"Dec 5,2019",
    "content": "<p><b>FALLING? NO WORRIES. RISE UP!</b></p><p> When we were a toddler, can you imagine how many times we would've fallen before learning how to walk? We would've never learned to walk without falling. Though we fell we rose up, again and again until we walked. So, I would really like to encourage you today &quot;RISE UP&quot;. </p><p>It doesn't matter how many times you've fallen or how badly you've fallen, I want to give you a hope that today when you rise, you will see the change, make a difference. </p><p>It is heart wrenching when we fail in our studies, lose hope when we don't get a job or fall in to a particular sin again and again, it's hard; believe me I've been there. But there is hope in Christ. Hold to that, have confidence in Christ and Rise Up. </p><p>For the righteous falls seven times and rises again (Proverbs 24:16).</p><p><b>SOAR LIKE AN EAGLE</b></p><p>Before the start of a heat, an Athlete always puts her head down. But when the gun shot is heard, she rises with power, runs with all her strength and crosses the finish line. Same way, the circumstances of our life may put our head down. But when our time comes, we rise with power, run our race with strength from above and cross the barriers of our life. So, wait till the power of God urges you to rise.</p><p><b>YOU ARE A CHILD OF THE HEAVENLY KING</b></p><p>Christ said &quot;Ask and it shall be given unto you&quot;. But how many of us beg instead of asking? God has made us his Children and He is the king of all The Earth. Imagine a Prince or Princess of a country. They don't beg their father the King, but whatever they ask is given to them. If the Prince or Princess ask something valuable, it takes time for the King to bring it from another country or to find it. Yet the King finds it and gives it to his loving heir. </p><p>We are children of The King of Kings. Will we lack any good thing? An earthly King may not be able to give his heir everything but our Heavenly King can provide His children according to His riches in glory. So, let's ask as a Prince or Princess would ask their father.</p><p><b>BE HUMBLE</b></p><p>There is a quote that goes like this 'When you don't have it, you don't have it; When you think you have it, you don't have it'. Humility is never found in those who compel themselves to be humble. I think humility is the involuntary thought of acknowledging God whenever we are appreciated. Being proud is not only about boasting about yourself, it has so many other things too. For example, there are people who are proud about their lineage, their family and surprisingly there are people who are proud about the fact that they are Christians. </p><p>But do we understand that the very breath, the heartbeat, the motor functions that we do is only because of the wonderful Grace of God? Do we realise that we are His children because He chose us before the foundation of the Earth? It is human nature to be proud of our Country, our lineage, our family. But those things should never make us feel superior, rather it should make us humble by the acknowledgement of the Grace that has been bestowed upon us.</p><p>We all want to be leaders. But, are we ready to clean the dirty feet of others without crumpling our face? A Real leader (May it be workplace, Church or home) does not turn his face away from the dirt of his follower. Rather, they clean it. Not with a resigned, accusing, fault finding heart but with humility that comes out of deep love.</p><p><strong>(Note: GHG team thank Ms. Jerina Joy for permitting us to use her article. May God bless her abundantly and use her for His glory. If you wish to send your article, mail it to mailtoghg@gmail.com)</strong></p>",
    "articleAuthorId":1
    },
    {
        "articleId": 14,
        "articleTitle": "GUEST ARTICLE - 14 (GOD CAN USE YOU THOUGH YOU ARE WEAK - WRITTEN BY MR. RAVI SHANKAR)",
        "date":"Dec 5,2019",
        "content": "<p>A stone is simply something which is useless, dead and good-for-nothing for normal eyes. But in the eyes of a sculptor, it is seen as a master piece of art. In your eyes, you may see yourself as a failure, a victim useless for God. But in God's eyes, you can be a master piece.</p><p>You see what you are now; God sees what you can become. You see a failure; But God sees a master piece. You see the effect now; God sees the potential for the future. You see a Victim now, God sees a Victor.</p><p>This amazing transformation from a victim to victor can become true if the Stone yields fully to the Sculptor's plan and trust Him through the making process.</p><p>Friends, God chose the foolish to shame the wise. He chose the weak to shame the strong. Do you feel now that you are weak? Then you are the right person for God. Because, in your life and through your life He will show what He alone can do provided if you yield and trust Him. </p><p>2 fishes and 5 loaves is not even a full meal for 2 persons. But for God, it is more than enough to feed 5000. Your lack will continue to be a lack in your hands, but in the hands of Jesus the same lack or insufficiency can feed thousands. Surrender your weaknesses to the lord and yield to His process.</p><p>Trust in the Lord during this phase of your life and you will see things what He alone can do.</p><p><strong>(Note: GHG team thank Mr. Ravi Shankar for permitting us to use his article. May God bless him abundantly and use him for His glory. If you wish to send your article, mail it to mailtoghg@gmail.com)</strong></p>",
        "articleAuthorId":2
    },
    {
        "articleId": 13,
        "articleTitle": "GUEST ARTICLE - 13 (I WILL MARCH ON WITH YOU - A POEM WRITTEN BY MS. SHALINA PERCY DELICIA)",
        "date":"Dec 5,2019",
        "content": "<p>It&rsquo;s Your love that keeps me strong</br>Springs to come and winters to go</br> Your faithfulness will lead me on</br> Twisted roads to follow</br> Rugged mountains to face</br> But You will see me through</p><p>Tired and exhausting is my journey</br> Oh Lord! Thou art my springs of water</br> My feet fail to stay on</br> As the way is unknown and desolate</p><p>Blinded are my eyes in the cover of darkness</br> Filling my heart with fears and doubts</br> &ldquo;Is this the path?&rdquo; I need to pursue</br> &lsquo;Yes&rsquo; came your assuring voice</br> Flooding my troubled heart with peace and calm</p><p>When nights grew long and</br> Trails seem endless</br> Your grace broke through and carried me on</br> The path is marked the same but</br> Its Your presence that makes it sweet</p><p>Lead me Lord, Lead me on&#8230;</br> With Your Presence lead me on</br> Flowers to trod on and thorns to trample</br> Hills to climb and valleys o traverse</br> Sunshine to enjoy and billows to pass by</br> I will march on Oh Lord</br> I will march on</p><p>Having You at my side</br> I will march on</br> Till I see myself on the other side of the river</br> I will march on with you </p><p><strong>(Note: GHG team thank Ms. Shalina Percy Delicia for permitting us to use her poem. May God bless her abundantly and use her for His glory. If you wish to send your article, mail it to mailtoghg@gmail.com)</strong></p>",
        "articleAuthorId":4
    },     
    {
    "articleId": 12,
    "articleTitle": "GUEST ARTICLE - 12 (GOD'S GRACE IS SUFFICIENT FOR YOU. HE WILL MAKE EVERYTHING BEAUTIFUL IN YOUR LIFE - WRITTEN BY MS. SHASTIPRIYA)",
    "date":"Dec 5,2019",
    "content": "<p>I&rsquo;m doing my Final year engineering (B.Tech-ECE) at a Christian engineering university. I thank God for given this opportunity to share how great His grace, an unmerited favour of God which have totally transformed my life from the state of failure to a success.</p><p>By the grace of God I was doing quite well in my studies till 9th grade. Suddenly there happened a great tragedy in my life that we as family met with a horrible accident. In front of my eyes I saw my beloved dad, whom I loved the most, dying. (I lost my beloved dad in front of my eyes). I also seen my mother fighting for her life at CCU but graciously God has given back her life. At this stage, many people of God fervently prayed for my mom&rsquo;s recovery and miraculously God healed her completely from her terrible injuries and now she is perfectly alright. </p><p>Since my dad was the one who loves me lot more than anyone else and all the time I was so pampered by him. Imagining life without him developed hatred and void in my heart as a result I gradually lost interest in my studies scoring just pass marks in my subjects. Since my dad was the only bread winner in our family (and my mother was a housewife and my elder sister was in 1st year of her UG) my relatives all told me to quit matriculation school and join a government school. However, Jesus Christ, my heavenly father took care of it by providing his unmerited favour to receive 75% fee concession and helped me to complete my schooling successfully in the same matriculation school and astonishingly God made me to join a Engineering University. </p><p>I can still remember the day of enrolment. At the time of enrolment process, looking at my +2 maths mark everyone criticized me saying, &ldquo;mathematics is base for all engineering subjects by having such a low mark you can never able to cope up with your studies and they added if u keep arrear it is very difficult to pass. But by abundant grace of God, He helped me to score &lsquo;S&rsquo; grade (85%-95%) in most of the maths paper. He also blessed me with 8+ CGPA with no history of arrear till the end.</p><p>At the beginning of 3rd year, great fear gripped my heart regarding my future but God clearly spoke to me saying &ldquo;Fear not, I have bright future plans for you&rdquo;. By hearing God&rsquo;s word I thought I will get placement in the first company itself but to my surprise I didn&rsquo;t even clear first round of 1st company after that I thought in second company I will be placed but I&rsquo;m not even eligible for that company then again I was awfully scared about my future even though God has promised me.</p><p>I couldn&rsquo;t wait for His timing, I started to weep at prayer cell throughout day in day out by questioning myself, how I will survive after completing my B.Tech, what will I do; where will I be; I couldn&rsquo;t even clear the aptitude itself; What I&rsquo;m going to do? But in God&rsquo;s time he made me to get through the 1st round of 7th company and He filled me with spirit of wisdom and made me to complete technical and HR round successfully and placed me at cognizant technology.</p><p>Through this God taught me that he will make everything beautiful in His time by bring us to a right place at right time to enjoy His ordained blessings in our life. Just we need to wait; things will happen just like that at His time. It&rsquo;s too hard for my family circumstance to pay my semester fees but according to Philippians 4:19 My God has met all my need according to His glorious riches in Christ Jesus so I was never been in out of roll for 8 semesters and every fees were paid ahead of due time. As Psalmist says in 34:10 &ldquo;The lions may grow weak and hungry, but those who seek the LORD lack no good thing&rdquo; it is very true in my life.</p><p>After experiencing such an unconditional, unfailing, everlasting love of God in my life. My heart was healed from all pains and hurting and now my heart was filled his joy and peace. </p><p> You may also have been despised by everyone, either people around you may tell that you are fit for anything or you may feel your good for nothing but God looks at you and says &ldquo;My Grace is sufficient for you and my strength will make perfect in your weakness&rdquo;. The grace which makes nobody like me to get placed, the grace which makes a failure to score 8+ CGPA, The grace which provided everything that I need to live happily that amazing grace is sufficient for you too to be blessed by Him. God never sees how talented you are, how good at your studies. But He loves you just as you are because He is your &rsquo;CREATOR&rsquo; just surrender your life in His hand and trust in Him alone and He will make you to be more than what you could be.</p><p><strong>(Note: My dear young friends, this article was written by Ms. Shastipriya. She is doing her B.Tech degree final year in a private university. GHG team thank Ms. Shastipriya for the article. May God bless her abundantly and use her for His glory. If you wish to send your article, mail it to goldenhandsofgrace@gmail.com)</strong></p>",
    "articleAuthorId":0
    },    
    {
    "articleId": 11,
    "articleTitle": "GUEST ARTICLE - 11 (CONSTANT HEARING OF GOD'S VOICE - WRITTEN BY MS. AYSHWARYA)",
    "date":"Dec 5,2019",
    "content": "<p>God doesn&rsquo;t reveal his whole agenda all at once to us. Even if He does we cannot ever perceive and our mind can never conceive it all. Hence His revelation comes gradually as time progress. So it is must to hear His voice constantly and not dwell on the past consideration. Don&rsquo;t consider either you got it all or you are so familiar with His ways because in <strong>Isaiah 55:8, 9 &ldquo;For My thoughts are not your thoughts, neither are your ways My ways, declares the LORD.As the heavens are higher than the earth, so are my ways higher than your ways and my thoughts than your thoughts.&rdquo;</strong></p><p>Recently God have taught me the importance of constant hearing of His voice. I would like to explain you the intrinsic worth of this truth from the life of the two great people - Noah and Abraham. </p><p>We all were so familiar with Noah&rsquo;s story that Lord reveals Noah that Lord going to put an end to all people, for the earth filled with violence because of them. So He decides to destroy both human and earth with forty days of flood-waters. Only Noah and his family found favor in the eyes of Lord. As a result He said Noah to build an ark with so and so measurement and to take with them so and so animals and required foods for forty days survival in ark. And Genesis 6:22 and 7:5 clearly says Noah did everything as God commanded him. </p><p>But one thing I like to emphasis the manner Lord commanded Noah to enter in to the ark and exit from the ark which is in Genesis 7:7 and Genesis 8:16, former verse says Lord said Noah to enter into ark along with his sons and followed by his wife along with his son&rsquo;s wives and Noah did as such. The latter verse says Lord said Noah to come out along with His wife followed by his sons along with their wives. But you know what Noah did? He came out as he entered into the ark. To facilitate you can read in Genesis 8:18 which says, he came along with sons and his wife along with his sons wives. You may ask what a big deal in it, when you read Genesis 9:18-27 you may understand that Noah did great blunder that he came along with his sons so he lived in tent along with sons because of that when he was drunk and lay uncovered in his tent, his youngest son was happen to see his father&rsquo;s nakedness. When Noah found out what his youngest son had done to him he cursed his own son (Ham the father of Canaan) and his whole generation has become cursed generation. If at all Noah doesn&rsquo;t failed to hear the voice of Lord constantly, he would have obeyed to what God had commanded o do thus he might be lived in a tent along with his wife and his youngest son may not happen to see his father&rsquo;s nakedness and may not be cursed by his own father. </p><p>Now let&rsquo;s come to Abraham the Father of Faith that in Genesis 22:2 only Lord asked Abraham to sacrifice his only lovable son Isaiah as burnt offering to Him and Abraham desperately obeyed the voice of Lord and took his son to the place where lord showed him. There Abraham built an altar and arranged the wood on it. He bound his son Isaac and laid him on the altar, on top of the wood. Then he reached out his hand and took the knife to slay his son. At that moment he again hears the voice of Lord which says, &ldquo;Do not lay a hand on the boy and Do not do anything to him&rdquo; (Genesis 22:12) He consciously obeys the voice of the Lord and did not laid his hand on the boy. Abraham was not just living out of what he had heard from Lord but he was living out what he is hearing from God. If at all like Noah, Abraham had stick on to what he heard from Lord then he might have killed his own promised son.</p><p>What I&rsquo;m trying to state from these both illustrations is that we all have to learn to live out life by what we hear from Lord and only not by what we heard from Lord. It is possible only when we have intimate relationship with our creator the Lord and savior Jesus Christ. Never have any pre-occupied mindset but have an open heart and mind to hear from Lord constantly and to walk in His ways.</p><p>We were all more privileged than Noah and Abraham because we have Jesus as our shepherd who said in John 10:27 that my sheep hears my voice. It is more than a command. It is a promise. Jesus is the living word who instructs us constantly and also has given Holy Spirit to guide us persistently. According to John 8:47, whoever belongs to God hears what God says. So now through Jesus Christ we belong to God and there is no doubt that we hear God&rsquo;s voice. But learning to hear His voice is not an event, it is day by day progression. You will hear Him more clearly as you learn to discern His voice in every walk of your life through intimate relationship with Him by reading bible and spending more time in prayer. Constant hearing to the voice of God is true life style of every believer.</p><p>According to John 5:24 as Jesus said <strong>&ldquo;Very truly I tell you, whoever hears My word and believes Him who sent Me has eternal life and will not be judged but has crossed over from death to life.&rdquo;</strong></p><p>You will receive life, joy, peace and you will never miss out any of His blessings upon your life as you learn to hear Him constantly.</p><p><strong>(Note: My dear young friends, this article was written by Ms. Ayshwarya. She is working as a guest lecturer in a college. GHG team thank Ms. Ayshwarya for the article. May God bless her abundantly. If you wish to send your article, mail it to goldenhandsofgrace@gmail.com)</strong></p>",
    "articleAuthorId":3
    },  
    {
        "articleId": 10,
        "articleTitle": "GUEST ARTICLE - 10 (GOD WILL SURELY FULFILL HIS PROMISES IN YOUR LIFE - WRITTEN BY MR. RAVI SHANKAR)",
        "date":"Dec 5,2019",
        "content": "<p>Dearly beloved in Christ, we, as the children of GOD have received so many promises (and prophecies) from GOD in our life. But unfortunately, many times we take them very lightly. There may be many reasons for us to show such an attitude toward GOD&rsquo;s promise, but the primary reason is <b>&ldquo;we always compare His promise with the current state of our life.&rdquo;</b> My dear beloved, that is not the right attitude. In our world, if a person promises us anything, we will always think about his/her potential to fulfill that promise before believing in the promise. In the same way, if GOD has promised us something; we just have think about the potential of the Promise-Giver and not about our current state of life. So can any one of us say that, GOD is impotent to fulfill His promise in your life? No friends,<b>our GOD is not Impotent, but OMNIPOTENT.</b> He is all-powerful. In Genesis 18, there is an incident recorded where 3 messengers were sent from GOD to bring judgement on Sodom &amp; Gomorrah because of their increasing immorality. On their way, these 3 men had a meeting with Abraham. At this point of time, Abraham was 100 years old and Sarah (his wife) was 90 years old. They didn&rsquo;t have a child of their own and also Sarah lost her ability to bear a child anymore. My beloved, this may be today your condition too; where you are not in a state to bear spiritual fruits for GOD. Your present life may not be fruitful.But the Promise-Giver (GOD) will certainly fulfil his Promise in your life in due time. So cheer up beloved. Now, coming back to the story, at this moment GOD gave a promise to Abraham saying that; <b>&ldquo;Sarah will bear you a child and she will give birth to a son in the next delivery period and in that son all the nations of the world will be blessed&rdquo;.</b> Sarah was hearing this promise which GOD gave to her husband Abraham and she LAUGHED at it.</p><p>Now, why did she laughed by hearing GOD&rsquo;s promise? Yes beloved, it is recorded in the bible that; she laughed thinking about the present condition of her life. She lost her ability to bear a child and hence, the promise of GOD became like a joke for her. She forgot to realise the potential of the Promise-Giver. My dear beloved, many of us are like Sarah. We laugh at the promises of GOD by comparing it with the current state of our life. We often forget the potential of our Heavenly Father who is an OMNIPOTENT GOD.</p><p>GOD&rsquo;s view on His promises for us is different. If your view about GOD&rsquo;s promises in your life is like the one of Sarah in the Bible, GOD is telling you today that; <b>&ldquo;If I was SERIOUS about my promise to Sarah, I am indeed SERIOUS about my promise to you. So if I am SERIOUS about my promise for you, then why not you be SERIOUS about it&rdquo;.</b> </p><p>Yes my beloved, GOD is very much serious about His promises in your life. Don&rsquo;t see at your present condition of life and take His promises lightly. Just remember this, <b>&ldquo;GOD is serious about His promises in the Bible and He proved it to us by fulfilling each one of them&rdquo;.</b> Yes beloved, If GOD was not serious about his promise to Abraham in Genesis 18, JESUS CHRIST, his son would not have come to this world.</p><p>Therefore, let us change our attitude in perceiving GOD&rsquo;s promises in our lives. Let us BELIEVE &amp; RECEIVE.</p><p><strong>(Note: This article was written by Mr. Ravi Shankar. He is currently working as a software engineer. GHG team thank Mr. Ravi for the article. May God bless him abundantly. If you wish to send your own article, kindly mail it to goldenhandsofgrace@gmail.com)</strong></p>",
        "articleAuthorId":2
    },
    {
    "articleId": 9,
    "articleTitle": "GUEST ARTICLE - 9 (GOD CAN UNDERSTAND YOUR SORROW AND PAIN - WRITTEN BY MR. RAVI SHANKAR)",
    "date":"Dec 5,2019",
    "content": "<p>On the evening of 22nd March, 2014; we went visiting house by house to share the Gospel (Good news) to them. On our way, we went inside one house, a very small hut I would say. It is such a small house. There was this lady who was staying alone. She will be around 60-65 yrs of age. She is from the Catholic background. Then she opened up and started to share with me her pain and problems. </p><p>Given below is what she shared with me:</p><p><strong>All my life, I have been more passionate and steadfast for Jesus Christ. I used to pray for hours daily and fast many days. The locality where I live is predominantly occupied by other religious people. In their midst, I am so zealous for Jesus Christ. Before some years, my daughter who was 18 years old at that time died due to a disease. A year before, my husband died and now I am all alone in this house. My neighbours are ridiculing me saying that, &ldquo;You said Jesus Jesus all the time, you prayed to Him all the time. But see; what He has done to you? He has taken one by one from your family and left you all alone.&rdquo; When I hear those words, I used to cry and ask God why have You done this in my life? But then, in due course of time; I tend to have this feel of Hatred in my heart towards God.</strong> </p><p>As I was totally helpless and did not know how to respond, I was praying inside my heart to GOD asking for a word from him for that woman. After everything, since we don&rsquo;t know what to say; I told her, &ldquo;Aunty, we will pray now. God will certainly comfort you&rdquo; and He really did. As I started to pray, suddenly the Holy Spirit put a word in my heart and I clearly know that the word is for that woman. From then on, that word became a life-changing revelation for me. This is what God told &amp; taught me that day. </p><p>It is true that the woman lost her daughter &amp; husband and staying all alone. But God told to her that only He can understand her pain because He had gone through the same pain of losing His beloved for us. Many times, we used to think this way that <strong>&ldquo;no one can understand my pain, my situation. Even God does not understand my situation&rdquo;.</strong> Because if He has, He would have shown up. *  My dear friends in Christ, let me tell this very clearly to you. Among all the so called GODs in this world, only our Father GOD can understand the pain that comes out of the loss of a loved one. Because He went through the same pain by losing His beloved son Jesus Christ for us, a totally underserved group of people. So be sure of one thing, even the whole world can&rsquo;t understand the pain &amp; agony you go through, Jesus Christ does understand your pain; because on the cross; the father and the son was separated because of our sins. Also on the same cross, Christ consumed death and rose again on the 3rd day victoriously.</p><p>The verse in Hebrews 2:18 says like this;<strong> &ldquo;For in that He himself has suffered, being tempted, He is able to aid those who are tempted&rdquo;.</strong> Also, in Hebrews 4:15, the Bible says like this, <strong>&ldquo;For we do not have a High Priest who cannot sympathize with our weaknesses, but was in all points tempted as we are, yet without sin&rdquo;.</strong></p><p>Secondly, God taught me that day; only our <strong>&ldquo;God can change a loss to one of his children as a profit to many in the world&rdquo;.</strong> Take a good look at Joseph in the Bible, God gave him dreams when he is young describing that, he will be held in a head position and his entire household will bow before him. But the course of the story changed in between and the father Jacob lost his son Joseph. Joseph was sold as a slave in Egypt. After many years, there came a severe famine upon the face of the earth. At that time, Joseph was appointed as the prime minister of Egypt and all the nations of the world came to him to get their grains for their daily living. If you see clearly, for Jacob, losing Joseph was a big loss and he was not even able to come out of that pain for quite a long time. </p><p>But God changed this Joseph as a blessing for the whole world. Take Moses for this case and you can see the same hand of God working like as that in the life of Joseph. Above all, take Jesus Christ, for the Father; to give away His only beloved son on the cross is a huge, unimaginable loss. But He willingly gave Him away to redeem us from this sinful and cruel universe. For the Father it is a huge loss to give away His son. But He changed the same loss into a fountain of blessing to the whole world as it records in John 3:16,<strong> &ldquo;God gave His only begotten son, that whosoever believes in Him will not perish and have everlasting life&rdquo;.</strong> </p><p>So my dear friends, if you are having loss in your life physically, emotionally, spiritually, etc. Remember our God is very much able to change that loss into a profit or blessing to many. So thank him for every adverse situation in your life because, God is going to change you as a blessing to many. Jesus told to Peter like this,<strong> &ldquo;After you get comforted, you comfort your brothers&rdquo;.</strong> In the similar way, God will comfort you in your adverse situation and He will enable you to be a source of comfort for others as it says in 2 Corinthians 1:3,4 <strong>&ldquo;Blessed be the God and Father of our Lord Jesus Christ, the Father of mercies and God of all comfort, who comforts us in all our tribulation, that we may be able to comfort those who are in any trouble, with the comfort with which we ourselves are comforted by God&rdquo;.</strong> </p><p>Finally, don&rsquo;t ever forget this verse irrespective of whatever you go through in your life. <strong>&ldquo;And we know that all things work together for good to those who love God, to those who are called according to his purpose&rdquo;</strong> &ndash; Romans 8:28. </p><p>May our Lord Jesus Christ reveal more of his unconditional Love towards you in the coming days. God bless you.</p><p><strong>(Note: This article was written by Mr. Ravi Shankar. He is currently working as a software engineer. GHG team thank Mr. Ravi for the article. May God bless him abundantly. If you wish to send your own article, kindly mail it to goldenhandsofgrace@gmail.com)</strong></p>",
    "articleAuthorId":2
    },
    {
        "articleId": 8,
        "articleTitle": "GUEST ARTICLE - 8 (A CALL TO WALK ON WATERS - WRITTEN BY MS. AGNES POULOSE)",
        "date":"Dec 5,2019",
        "content": "<p><b>&quot;Come,&quot; he said. Then Peter got down out of the boat, walked on the water and came toward Jesus. - Matthew 14:29</b></p><p>So what happens when someday you stand face to face with reality, when the pressures of your life are just waiting for you to open the doors to your mind so that they can just squeeze into the meager space that you&rsquo;ve left for yourself, or when the truth, the questions that you&rsquo;ve been trying to evade confront you, when you feel that life&rsquo;s just giving you a hard time? You might have had a smooth sail till now, but just when you begin to think that nothing can go wrong in your life anymore, your whole world comes crashing down in front of you? Would you still be able to lift up your hands and praise His name? Would you be able to stop yourself from questioning God?</p><p>When Jesus called Peter to walk on water, He wanted Peter to trust Him completely. As long as Peter had his eyes fixed on Jesus and not on the raging seas and the storm around him, he could walk towards Jesus, and he could claim the miracle for himself; but when he realized that he was walking on water, and saw the waters that were overwhelming, he started drowning. It was a test of faith in which Peter failed. At times God asks us to do the impossible; to forget everything, and to trust Him completely. He asks us to believe, and claim our miracle, but because of our little faith, we fail. We fail to realize that our Father is the maker of heaven and earth and that even the very hairs of our head are all numbered (Matthew 10:30). He is the Lord of all creation; there is nothing too difficult for Him (Jeremiah 32:17). He knit us together in our mother&rsquo;s womb (Psalm 139:13), He knew us even before we were formed in her womb (Jeremiah 1:5). He has given us so many promises, but still sometimes we fail to trust in Him. Ever wondered why?</p><p>I&rsquo;m sure most of us would&rsquo;ve praised God when we come out of a difficult situation, or when every problem in our life seems to have a solution, but what happens when we don&rsquo;t have a solution? What happens when we&rsquo;re on the verge of losing everything? Most of us give up, others hold on just &lsquo;coz they have no other option, and a very few trust in the Father. </p><p>Hasn&rsquo;t the Lord promised us that those who wait upon the Lord will soar with wings like eagles, that they shall renew their strength (Isaiah 40:31). The reason why most of us lose hope and give up is because we look at the storms in our life and don&rsquo;t fix our eyes on Jesus. The reason why we drown ourselves in a sea of self pity at times of these trials is because we do not believe in miracles. We do not believe that the God who can raise a dead man to life, is able to heal the cancer, we do not believe that the God who made the lame to walk, and the blind to see is capable of curing the tumor or the headache, we fail to believe that the God who ate with tax collectors and forgave the adulteress woman, could forgive our sins. He can do anything for us. </p><p>All He wants us to do is turn to Him and ask. Weep before Him, cry out to Him and tell Him that we&rsquo;re hurt. We might feel that this hurt is beyond repair, but Jesus is the one who took the form of man, lived among us, and suffered, just so that all our sins might be forgiven, so that every sickness can be healed, and every sinner be saved (John 3:16).</p><p><b>Peter said to Him, &quot;Lord, if it is You, command me to come to You on the water.&quot; (Matthew 14:28).</b></p><p>Peter had asked Jesus to command him to walk towards Him. Our lives as believers begin when we allow Jesus to enter into our hearts, when we allow Him to test us, break us and mould us. Our lives become better and we see God working. Invite Him to come and take away everything in your life that has been keeping you away from Him. Allow Him to take His rightful place in your heart, and make your body His temple. Trust Him, and He will make a way for all your problems. The trials of today will be the reason for your joy tomorrow (John 16:20). Ask Him to call you out on the water, and walk with your eyes fixed on your creator lest you may fall. He is able.</p><p>Sometimes these words may seem to be just empty promises, but as you get to know Jesus, as you understand the depth of His love, you&rsquo;ll know that there is no greater love that His and that even if He has allowed these testing times in your life, it&rsquo;s because He loves you. He will make sure that you feel loved and blessed even when you&rsquo;re drowning. He will lift you up, set you on a solid ground. He is like a potter, making you into His perfect masterpiece. Allow Him to break you and strengthen you, so that you&rsquo;ll be able to stand and testify, so that you&rsquo;ll be able to smile through your bad times and praise Him in every storm. Look around and you&rsquo;ll know that you have a million reasons to bless His name.</p><p><strong>(Note: This article was written by Ms. Agnes Poulose. She is an engineer. GHG team thank Ms. Agnes Poulose for the article. May God bless her abundantly. If you wish to send your own article, kindly mail it to goldenhandsofgrace@gmail.com)</strong></p>",
        "articleAuthorId":5
    },
    {
        "articleId": 7,
        "articleTitle": "GUEST ARTICLE - 7 (FAILING TO REPENT)",
        "date":"Dec 5,2019",
        "content": "<p>We are presently going through the lent season. Lent is a special season provides time for believers to get closer with God and to reconcile with Him by focusing on repentance. During this season, we used to fast, pray and meditate the word of God and love of God portrait on the cross. The ultimate goal of all these is to lead us to have &ldquo;True repentance&rdquo;.</p><p>What does &ldquo;true repentance&rdquo; means? The biblical definition for true repentance is a change of mind that results in a change of action (Luke 3:8-14; Acts 3:19; Acts 26:20 declares, &ldquo;I preached that they should repent and turn to God and prove their repentance by their deeds&rdquo;) on contrary, the absence of either change of mind or change of action leads to False Repentance. </p><p>Isn&rsquo;t it must to know why true repentance is crucial in one&rsquo;s life? What happen if we don&rsquo;t truly repent? Come let us examine the significant risk of false repentance from the light of God&rsquo;s word. The spot light of our meditation is focused on 3D&rsquo;s of false repentance which is dangerous and brings disaster in our life. Should we not be aware of those 3D&rsquo;s repentance which destroys our own lives? Yes, we must know those 3D&rsquo;s.</p><p>They are <ul><li><b>D</b>elay Repentance</li><li><b>D</b>eny Repentance </li><li><b>D</b>evoid Repentance</li></ul></p><p>These 3D&rsquo;s phases of repentance make us unable to receive true forgiveness of God in our lives. Why? Proverbs 28:13 says people who conceal their sins will not prosper, but if they confess and turn from them, they will receive mercy. This verse vivid that we cannot receive God&rsquo;s mercy if we delay, deny and devoid confessing our sins to God and its equivalent to conceal our sins. Now let us explore these 3D&rsquo;s seen in the lives of two personalities given in the scripture as an instance.</p><p><b>Delay Repentance of Achan</b></p><p>When Israelites had their great journey towards Canaan, they met a terrible and unexpected defeat at Ai. Though the people of Ai were very few in number than Israelites they defeated them. When Joshua enquired God about their defeat, He states the reason in verse Joshua 7:11,12 God says <strong>&ldquo;Israel has sinned and broken my covenant, they have stolen some of the things that I commanded must be set apart for me. And they have not only stolen them but have lied about it and hidden the things among their own belongings. That is why the Israelites are running from their enemies in defeat&rdquo;.</strong> God also said to Joshua that He will not remain with them any longer unless they destroy the things among them that were set apart for destruction.</p><p>In verse Joshua 7:14-15 Sovereign God commands Joshua &ldquo;<strong>In the morning, present yourself tribe by tribe. The tribe the Lord chooses shall come forward clan by clan; the clan the Lord chooses shall come forward family by family; and the family the Lord chooses shall come forward man by man. Whoever is caught with the devoted things shall be destroyed by fire, along with all that belongs to him. He has violated the covenant of the Lord and has done an outrageous thing in Israel!&rdquo;</strong></p><p>Now, you may wonder why God has to follow this tedious strategy to find out the guilty man. God is omniscient and omnipotent. God not only knows the reason but also the person who is responsible for the defeat. Then why God has to abstain himself not to reveal the culprit directly to Joshua by name. He did it because God never takes any pleasure in the death of the wicked. Rather, He is pleased when they turn from their ways and lives (Ezekiel 18:23). For that reason, God gave period of time as last chance for Achan to realize his sin and repent for it. But what Achan did? He delayed his repentance. Until Joshua begged him to accept the truth Achan kept num. only after he realized that he cannot cover the sin anymore in verse 7:20 he confessed that he had sinned against the lord God of Israel and he said what he done with devoted things. Since Achan missed out God&rsquo;s grace period for his repentance he had to face God&rsquo;s judgment and his end was pathetic death. Delaying repentance is actually known to cause your flesh to decay.</p><p><b>Deny Repentance of King Saul</b></p><p>After Saul was anointed to be King, God instructed Saul through Samuel with condition in I Samuel 10:8 that Samuel will surely come down to Saul to sacrifice burnt offerings and fellowship offerings, but Saul must wait seven days until He come to Saul and tell Saul what Saul are to do. When we read I Samuel 13:8-13 due to Saul impatience he offered unlawful sacrifice to God which should be done by priest not by king. Saul partially disobeyed God&rsquo;s word and act foolishly that he waited for 7 days but he didn&rsquo;t wait till Samuel return to him and instruct him what to do next. Even when Samuel pin point Saul&rsquo;s mistake, he deny repenting and deny accepting unlawful sacrifice he made to God. So Lord has sought for Himself a man after His own heart, and the Lord has terminated Saul&rsquo;s kingdom, because Saul have not kept what the Lord commanded him. As long as we were justifying or covering up things in our past we will never be all that we can be for God&rsquo;s glory. They will always stand in your way from being used by God in the ultimate way that God has in mind for you. So, never deny repentance in your life if so then you will lose God&rsquo;s plans and purpose in your life.</p><p><b>Devoid of Repentance</b></p><p>Again Saul disobeyed God&rsquo;s word.<strong>I Samuel 15:2,3 says, &ldquo;Thus says the Lord of hosts: I will punish Amalek for what he did to Israel, how he ambushed him on the way when he came up from Egypt. Now go and attack Amalek, and utterly destroy all that they have, and do not spare them. But kill man and woman, infant and nursing child, ox and sheep, camel and donkey.&rdquo; But what Saul did?I Samuel 15:9 says, &ldquo;But Saul and the people spared Agag and the best of the sheep, the oxen, the fatlings, the lambs, and all that was good, and were unwilling to utterly destroy them. But everything despised and worthless, that they utterly destroyed.&rdquo;</strong> </p><p>When Samuel disclosed God&rsquo;s heart to Saul, Then Saul said to Samuel, &ldquo;I have sinned, for I have transgressed the commandment of the Lord and your words, because I feared the people and obeyed their voice. Now therefore, please pardon my sin, and return with me, that I may worship the Lord.&rdquo; Though Saul repents why didn&rsquo;t God show mercy to him because Saul doesn&rsquo;t repent truly? Yes Saul Repentance was devoid i.e. empty he repent only by words not by heart. So God doesn&rsquo;t show mercy to him because God weights heart(Proverb 21:2), works(Proverb 3:2) and the spirit (Proverb 16:2). End of Saul&rsquo;s life was also terrible that he was killed by the person whom he spared. </p><p>My dear friends, sometimes we use to take things carelessly and think that we can repent later or partially repent and even deny repenting. Today, decide to avoid covering sin for quite long time and don&rsquo;t justify your sin and never be reluctant to repent rather come to Jesus today. He has already paid the price for you on the Calvary. He forgives you and cleanses you with His precious blood and makes you receive God&rsquo;s mercy in your life. Our true repentance surely draws us near to God and makes us to live and have eternal life. So why do you wait? Utilize this lent season and repent truly. </p><p><strong>(Note: My dear young friends, this article was written by Ms. Ayshwarya. She is working as a guest lecturer in a college. GHG team thank Ms. Ayshwarya for the article. May God bless her abundantly. If you wish to send your article, mail it to goldenhandsofgrace@gmail.com)</strong></p>",
        "articleAuthorId":3
    },  
    {
        "articleId": 6,
        "articleTitle": "GUEST ARTICLE - 6 (LOVE THE LORD YOUR GOD WITH ALL YOUR HEART, SOUL AND MIND)",
        "date":"Dec 5,2019",
        "content": "<p>Jesus is the perfect expression of love. He lived to die for our sins. He proved to us His true love by sacrificing His own life. That is why we can boldly say that Jesus loves us unconditionally. The same Jesus is expecting something from us...it&rsquo;s our love in return. So, how can we demonstrate our love to Jesus?</p><p>Mary Magdalene was one of the women followers of Christ. She was the first person to witness the empty tomb and the resurrected Jesus. Before she followed Christ, she was possessed with seven demons. Jesus set her free and gave her a new life. From then on she started to follow Christ. How did this Mary Magdalene demonstrate her love to God after she got saved from the clutches of devil?</p><p><b>1. Surrendering everything:</b>  We read in Luke 7:37 that Mary poured an alabaster jar of perfume at the feet of Jesus. According to Jews tradition, the costlier and valuable alabaster ointment will be poured at the feet of husband to tell that wives are their life. When Mary Magdalene did that, she truly meant that Jesus was her life. She surrendered her past, present and future at the feet of Jesus. She trusted Him completely and loved Him; that is why surrendered everything to Jesus. We also need to surrender our lives to Him, to show that Jesus is our only life.</p><p><b>2. Seeking Him early:</b>  We read in John 20:1 that Mary Magdalene went to the tomb early in the morning when it was yet dark. Out of her love, she went to see Jesus even before sun rise. Mary Magdalene lived in ancient times where ladies were restricted based on culture. If a woman is found walking alone in dark time, they&rsquo;ll be condemned to death. They were never allowed to go out in dark or even in early mornings. But she was determined and had overcome those obstacles in order to meet Jesus. This shows the depth of her love. Are we overcoming the obstacles like our tiredness, laziness or any other things to show our love towards God? When I was a kid my grandma won&rsquo;t allow my mom to pray; so my mom would get up early in the morning before my grandma could wake up (i.e. before sun rise) and pray. That prayer mattered a lot in our family. In the same way, God expects each and every one of us to seek him early in the morning. </p><p><b>3. Focusing only Him:</b>  We read in Luke 7:36-39 that Jesus was in a house to have dinner with a man. Though Jesus was not the only person there, Mary did not notice anything else in that dinner except Jesus. She was not bothered what others would talk about her. She was just focused on Jesus and only His words mattered to her. Also we read in John 20:14, 15 that Mary was speaking with angels and she turned herself to see Jesus. Though she was talking to angels, she was not contented. She was desperate to see Jesus and that shows her love. As she was focused only on Him, she saw the resurrected Jesus. She focused her heart only to God&rsquo;s word and not to the words of other people. Even today, we can demonstrate our love by just focusing on Jesus and prioritizing Him in our lives.</p><p>Jesus proved His love. He is longing for your love today. Demonstrate your love to Jesus and make Him happy. Your true love is the long awaiting happiness which Jesus will experience. So, express your love today and make Jesus smile!</p><p><strong>Note: My dear young friends, this article was written by Ms. Shastipriya and it was edited and modified by Ms. Melinda Charlet. Both are studying 3rd Year Undergraduate Course in Electronics and Communication Engg. GHG team thank Ms. Shastipriya and Ms. Melinda Charlet for the article. May God bless both of them abundantly. If you wish to send your article, mail it to goldenhandsofgrace@gmail.com)</strong></p>",
        "articleAuthorId":0
    },
    {
        "articleId": 5,
        "articleTitle": "GUEST ARTICLE - 5 (TO YOUNG STUDENTS: LORD WILL BLESS YOUR EFFORT AND YOU WILL SHINE FOR HIS GLORY)",
        "date":"Dec 5,2019",
        "content": "<p>Dear young students,</p><p>This article is especially for you (The student). How your last academic year was? Hope all have got good results. Some might be so happy or some might be disappointed with your results. </p><p>Whatever it is, it&rsquo;s all gone and by grace of God you all have got a new fresh academic year 2013-2014 to enter. As for some, who appears for board exams (10th, 12th) and who are in final year of their degree programme this year might be most significant one. So, are you really excited to have new start? Or Are you dreadful or disinterest because of past disappointments or failures? Do not worry my friends Jesus says, He will crown this year with His goodness and your path will drip with His abundance (Psalm 65:11). Amen! Expect great doings from our Great God. Our sweet Jesus wants you all to be more than conqueror to glorify His name through your academics too because in Him are hidden treasures of wisdom and knowledge (Colossians 2:3) and is He who gives you victory in your studies (1 Corinthians 15:57).And it is nature that each and every children of God wish to excel in their studies and desires to obtain good results for God&rsquo;s glory. Jesus is also ready to help you and bless you abundantly to make you secure good marks.</p><p>Here a testimony of girl to encourage you and make you trust God in all your weakness. Her name is Jenifer and when she was 12 years old, suddenly her platelets gone down. All treatments proved to be futile. Doctors gave up on her but still she and her parents trust God and surrender her life to Him. She was alive only by God&rsquo;s grace but then she faced numerous weaknesses such as vomiting, giddiness due to increase in flow of blood. Two years were passed, last year she entered 10th grade and she has to appear for board exam with all these weakness. Everyone thought how she will pass 10th and even her parents and teachers doesn&rsquo;t have hope as she was unable to attend classes regularly due to her sickness. But then Jenifer was determined to commit her life to God, amidst of all her agony everyday Jenifer never fails to seek God first and she also try her level best to study. Amazingly God gave her a great victory in her studies as end of last month 10th result was published to the surprise of all, she got 493/500 and God made her school first and honour her among the people who look down on her. </p><p>This is the abundant blessing that Jesus has in store for you too and God want us to bless every children of God in the same miraculously way in your academic life. You may think then why I couldn&rsquo;t experience this abundance blessing in my academics life?</p><p>There may be so many reasons for that name it lack of wisdom and knowledge, lack of hard work, low concentration, poor memory power, lack of interest, absent-minded, lack of responsibility, lethargy, laziness, peer pressure, physical weakness, incompetency, incredulous etc. These were abstaining to achieve the abundant victory that God has promised in your life. But then, there is solution for us to overcome all these drawbacks it can be find through reading and meditating the word of God on daily basis and praying and filled by Spirit of God every day. For instances, as in James 1:5 God gives us wisdom generously if we ask Him. In same way, for every problem there is solution in the bible only if you read it you find the way for success.</p><p>Do you want to know the secret of obtaining abundant mark in every subject you study? Do you want to know God&rsquo;s principle behind it?</p><p>As you read in Genesis 26:12, 13. Isaac sowed in the land even though there was famine in that land and He reaped in the same year a hundredfold because Lord blessed Him. Look Isaac, even in time of famine he was not idol. He took effort to plough the field and sow the seed and watered it and also maintains the field removed the unwanted crop and wisely Isaac utilised all the resource given by God. So, God blessed Him abundantly in hundred fold. In the same way, God can bless you only if you put the best effort that you can that is act of sowing seed though the circumstances are not favour for you. Understand that only God who gives you the increases (1 Corinthians 3:6) and unless you sow the seed you cannot reap hundred fold increases that God has in store for you. Remember only God can multiply your little effort and gives you good and best result.</p><p> It is simple mathematical concept, (100+100)/2=100. The mark you obtain is always equal to Sum of average of work done by you and work done by God through you by His grace. To make it clear, how much you prepare by studying, putting your maximum effort everyday + how much you depend on God by not leaning on your own strength but seeking Him every day. Totally gives you 100% good result in abundance. Suppose, if you trust only your own strength and effort 100 out of 100 and fails to allow God to work along with you 0 out of 100 then your result will be only (100+0)/2=50% and in vice versa if you trust God 100/100 and failed to put your effort 0/100 then again your result will be (100+0)/2=50%. So, do your part then God does His part. As in proverbs 21:31 you prepare for day and victory comes from the Lord.</p><p>Then you may ask can I score good marks in every subject if I follow this principle? Yes, absolutely you can accord Philippians 4:13. You can do all things through Christ who strengthens you. Allow God to work in you and through you. </p><p>Here are the few suggestions to remind you to be in the track of victory:</p><p>1. Seek His Kingdom and His righteousness first then all this shall be added to you (Matthew 6:33) 2. Fear of God is shunning the evil and it&rsquo;s very important to lead successful life. 3. Commit all your ways and days to the Lord. 4. Don&rsquo;t compare yourself with others because it leads you to have envy or to have self pity or to have pride. These things God hates. 5. We all are accountable for all the resources (time, energy and wisdom) that God has given us so it is reminder to utilise all of it wisely at fullest for God&rsquo;s glory in this new academic year.</p><p>You are born to be winner and not a looser. In the name of Lord Jesus Christ you called to be more than conqueror. Have a victorious academic year ahead. Wish you all God&rsquo;s very best in your life. May God bless you abundantly.</p><p><strong>(Note: My dear young friends, this article was written by Ms. Ayshwarya. She is working as a guest lecturer in a college. GHG team thank Ms. Ayshwarya for the article. May God bless her abundantly. If you wish to send your article, mail it to goldenhandsofgrace@gmail.com)</strong></p>",
        "articleAuthorId":3
    },
    {
        "articleId": 4,
        "articleTitle": "GUEST ARTICLE - 4 (MARRIAGE - A SPECIAL GIFT FROM THE LORD)",
        "date":"Dec 5,2019",
        "content": "<p><b>Proverbs 18:22 says &ldquo;He who finds a wife finds what is good and receives favour from the Lord.&rdquo;</b></p><p>As every other girl/boy, I also had many dreams about my future life partner during my college days. I was really excited about how my future life would be after my marriage. I was really worried about the same on seeing the problems some of my friends faced. I was told that we can always pray to God, how our future wife/husband should be. So I started praying about it by listing down so many points as what are all the qualities he/she should possess. But as I was praying, God said, <b>&ldquo;You wanted to be fit in the jar of particular size but I wanted you to be the perfect lid of the beautiful jar.&rdquo;</b></p><p>From that day onwards I realised that &ldquo;My Future Is In God's Hands, But I Hold the Key to Unlock It!&rdquo; I started praying like, &ldquo;Lord please mould me and make me, so that I could be the best for my future partner whom you have kept for me. Mold me and make me&#8230;we are the clay, and you are our potter; we are all the work of your hand.&rdquo; (Isaiah 64:8)</p><p>I want to encourage you with this illustration. Just imagine that we are hiding under His wings and someone is praying for us and searching for us. Atlast they realize that we are hidden in His presence and longs for us. Finally we become ONE in God&rsquo;s presence. Wow!!!!!... How Amazing it is to be in God&rsquo;s hand and in His plan.</p><p><b>[..hide me in the shadow of your wings.(Psalm 17:8) May you be richly rewarded by the LORD, the God of Israel, under whose wings you have come to take refuge.(Ruth 2:12) May you be richly rewarded by the LORD, the God of Israel, under whose wings you have come to take refuge. (Psalm 27:5) How priceless is your unfailing love, O God! People take refuge in the shadow of your wings. (Psalm 36:7) Because you are my help, I sing in the shadow of your wings. (Psalm 63:7)]</b></p><p>Lord&rsquo;s word says whoever finds a wife, finds good <b>(A wise - A good wife; one that deserves the name, and performs the duty of that relation)</b> and finds favor <b>(Favor - Obtains her not by his own diligence, but by God's good providence)<b> from the Lord.</p><p>Let us wait in the Lord, focusing on Lord Jesus Christ in every walk of our life. And by His grace we will receive this special favor from the Lord.</p><p>Let us offer this prayer in Faith:</p><p>Our loving father Lord we come before your throne with praise and thanksgiving. How priceless is your unfailing love, O God! People take refuge in the shadow of your wings. Help me to be under your wings and wait till the day you have appointed for my life to receive the special gift from you for the rest of our life. Amen.</p><p><strong>(Note: My dear young friends, this article was written by Ms. Jenifer Mery. She is working as a counsellor in a Christian University. GHG team thank Ms. Jenifer Mery for the article. May God bless her abundantly. If you wish to send your article, mail it to goldenhandsofgrace@gmail.com)</strong></p>",
        "articleAuthorId":6
    },
  {
    "articleId": 3,
    "articleTitle": "GUEST ARTICLE - 3 (WAITING PHASE: CHOICES AND CONSEQUENCES)",
    "date":"Dec 5,2019",
    "content": "<p>Recently, I was pondering over all the wonderful promises that I received from the Lord Jesus Christ, which really boasted my soul and spirit and was filled with overwhelming joy to know God&rsquo;s ordained plans for my future. But when I look at my present circumstances it contradicts to what God has promised me. Then I wonder, whether I will ever experience these promises of God in my life. Though I know for sure that My God is not a man to lie, but I was still asking God how long I should wait to see his promises come real in my life.</p><p> This waiting phase of life seems to me as a season of drought, a path of wilderness and a stage of uncertainty. Gradually, a seed of doubt and fear was sown in my heart, which started to ruin my mind; I had a feeling of living a bitter and fruitless life. Suddenly the Holy Spirit of sovereign God interrupts my thoughts and said &ldquo;Dear child, do you know why as a child of God you have to go through this waiting period, which you find so hard to endure even after receiving Lord&rsquo;s promise of blessings in your life?&rdquo; I kept mum. Then He taught me 3 reasons for why God allows this season of drought, this path of wilderness and this stage of uncertainty before I could enjoy the blessings of God in abundant. </p><p>The reasons are: 1. To display the glorious power of the true living God through your life. 2. To make you understand God&rsquo;s faithfulness and His unfailing love towards you forever. 3. To prepare your heart to receive God&rsquo;s blessing with all humility knowing that these blessings are only due to His grace.</p><p>He continued to teach me the most important lesson from the lives of 3 Biblical characters; they also came across the stage of uncertainty, season of drought and path of wilderness. Through their lives the Holy Spirit of God taught me some do&rsquo;s and don&rsquo;ts and warned me to be careful in the choices I take up during this period of waiting upon the Lord for which I have consequences to face. I would like to share that with you.</p><p>Don&rsquo;t fear like Sarai Genesis chapter 15 says The Lord&rsquo;s Covenant with Abraham. We could see that Lord had promised Abraham a son at age of 80 and also prophesied about his descendant. Lord gave wonderful promises to Abraham when he was exactly in a stage of uncertainty but still the Father of Faith (Abraham) trusts the Lord and believes that his promises will come true. It is common for every good husband to share everything with his wife; obviously Abraham would have also shared and encouraged Sarah with promises of Lord. Even after knowing firm plan of Lord, Sarah dares to ask her own husband to sleep with her servant (Genesis 16:1-4). Which no women will agree to do so but Sarah did that? Do you know what made poor Sarah to make such abominable decision against God&rsquo;s own plan and will for her? It is her Fear that failed Sarah to trust the Lord. Fear is a powerful tool used by the enemy to destroy peaceful future which God has in store for us. Though our Lord forgives our mistake still we have to face its consequences. Even now there are constant conflicts between Ishmael descendant and Israel descendant. They remain mortal enemies for thousands of years.  Yes, if at all Sarah waited patiently with faith trusting the Lord who will fulfil His promises at His due time then today we might be able to hold God&rsquo;s peace rather than battling with Ishmael descendant. But it&rsquo;s all because of wrong choice of Sarah who gave room to fear during this period of waiting and made us to face the consequence even after many generations. So, wait for Lord who made everything beautiful in His time never choose to neither fear nor lean on your own understanding rather have FAITH and wait patiently for Lord&rsquo;s time. Then you can inherit God&rsquo;s promises in fullest with His peace. Don&rsquo;t doubt like Zechariah</p><p>There is another couple in the New Testament who almost underwent similar circumstances of experiencing season of drought for very long time which can be read in 1st chapter of Luke. They are Elizabeth and Zechariah, the bible records clearly that &ldquo;Both of them were righteous in the sight of God, observing all the Lord&rsquo;s commands and decrees blamelessly. But they were childless because Elizabeth was not able to conceive, and they were both very old.&rdquo; </p><p>Eventually the Angel of God appears to Zechariah and promises him the most blessed and joyful future through his son John, the Baptist. Angel of God guaranteed Zechariah saying, &ldquo;Your prayer has been heard. Your wife Elizabeth will bear you a son, and you are to call him John&rdquo; and prophesied about the life of his son, John. Instead of rejoicing, Zechariah was doubtful in the Lord&rsquo;s promise and he questioned the angel of Lord which provoked the anger of God&rsquo;s angel so he punished Zechariah to be silent and not able to speak until the day this happens, because Zechariah did not believe the Lord&rsquo;s words, which will come true at their appointed time. This seed of doubt crushed the happiness that Lord has promised. Doubt is another powerful tool used by enemy to hinder the joyful future that God has planned for us.</p><p> What a pathetic condition it was for Zechariah because of His own unbelief he became mute and he couldn&rsquo;t even share it with his own wife about the feeling of becoming a father. Never doubt God&rsquo;s promises it will come true at his appointed time till then wait patiently with faith. Instead of facing unnecessary pathetic consequences because of your wrong choices of giving room to doubt and having unwavering FAITH on the Lord, If suppose you wait hopefully with full expectancy of God&rsquo;s promises being fulfilled then you can enjoy the waiting period too, with no regrets.</p><p>Do have faith like Mother Mary</p><p>As we have known well about conversation of Gabriel (angel of God) with mother Mary and Promises of the saviour&rsquo;s Birth. This can be read in Luke 1 where Mary too went through the path of wilderness till she gives birth to Jesus. Mary also questioned the angel of Lord but it was not the question of doubt, it was a question of conforming God&rsquo;s promises, that&rsquo;s why the angel of God confirmed it through the testimony of Elizabeth to boost up the faith of Mary on the Lord.</p><p> Mary took the road which no women on this earth has or had taken in their life. On those days it is not at all at ease to be conceived before marriage, if so people will stone them to death. Knowingly she risked her own life. She said to God, &ldquo;Let it be to me according to your word&rdquo;. She was fully committed and totally surrendered herself in fulfillment of God&rsquo;s promises. Do you know what made ordinary Virgin Mary to take up this courageous choice of facing the Consequences of this world? It&rsquo;s her unexceptional faith on the true living God which made her to carry the son of God with the shadow of the Holy Spirit.</p><p>God himself took responsibility to convince Joseph and made a beautiful life for humble Mary. As Mary underwent this period of waiting to see Jesus she took the path of wilderness with a heart of faith and song of praises (luke1:46-55). She neither fears how it will happen nor doubted whether it will happen instead she believed with her strong faith on the Lord and inherited God&rsquo;s promises with full of joy and without consequences.</p><p>Most of the time, there&rsquo;s a season of waiting involved in everyone&rsquo;s life. Maybe you&rsquo;re waiting for a relationship to improve; waiting to get married; waiting for a job; waiting for a promotion, or waiting to overcome an illness. Much of life is spent waiting. But there&rsquo;s a right way to wait with the right choice of faith on the Lord and a wrong choice of fearing and doubting. Too often, when things don&rsquo;t happen on our timetable, we get down discouraged or anxious and fretful. That&rsquo;s because we give room to fear and doubt during the period of waiting but learn to be careful that you have to face the consequences for your choices. So never choose that wrong choice anymore but have faith on this unchanging God who fulfils all His promises at His due time. </p><p>3 Tips for growing in Faith on Lord and to be an over comer of all fears and doubts are:</p><p>Focus only on Jesus and His promises not on your own ability or circumstances.</p><p>Look at yourself and your circumstances through the eyes of Jesus.ie see yourself as God sees you.</p><p>Confess, pronounce and declare the promise of Jesus Christ on your life everyday because there is a power of life and death on your tongue.</p><p>So keep your thought, sight and tongue under the blood cover of Jesus Christ and enjoy every moment of your life with joy and happiness that the Lord has promised you every day.</p><p><strong>(My dear young friends, this article was written by Ms. Ayshwarya. She is doing her PG studies in Bioinformatics. This article was edited by Ms. Joceline. GHG team thank Ms. Ayshwarya for the article and Ms. Joceline for editing. May God bless both of them. If you wish to send your article, mail it to goldenhandsofgrace@gmail.com)</strong></p>",
    "articleAuthorId":3
  },
  {
    "articleId": 2,
    "articleTitle": "GUEST ARTICLE - 2 (WHY GOD CREATED US?)",
    "date":"Dec 5,2019",
    "content": "<p>Why GOD created us and what is the reason behind it? Many of you would have heard this in either a Christian convention or a charismatic church or in some youth revival camp. But I am sure as a Christian you would have come across this question in your life. Do I know the answer? Do any of my friends know the answer or does my Pastor know the answer? Is GOD the only person I can get the answer from or is there an answer at all? Well we can be pretty sure about one thing though. Our GOD is an orderly GOD (1 Corinthians 14:33), He is not someone who creates something, for example the human kind without a reason or a purpose. I am writing below the different answers I received for this question in different times and seasons of my life. May be you too are going through one these moments in your life.</p><p>I was born in a Christian Family. So reading the bible, going to church, sitting for family prayers was a natural thing to do. As a kid I just thought this was normal. I had to memorize my bible verses to get my food, yes my mother was strict. Telling your problems to GOD, thanking him for everything He did in your life was an everyday affair. I just thought that GOD was a great person to have by your side. I mean, common everybody said He is big, He is great. Why not have Him by you. The question that time was what I can give Him to ask Him to stay by my side. My family participated a great deal in the church activities I was also encouraged to participate in the church choir. So I would say I was a bit more exposed to preaching in the church than my peers. Being in the church and choir when confronted with this question, I came to the conclusion that I was created to praise GOD. GOD created us, loved us and died for us. As a teenager this was what I thought the answer was. The reason for my creation was to praise GOD.</p><p>In the mean time GOD blessed me a lot in my school; I also had an opportunity to study my bachelors in an Engineering college. GOD raised me up among my family, friends. Where ever I went people treated me with special care, I knew this was because I was a child of GOD and I continued in my reasoning that the purpose of my creation was to praise GOD. Later in the final years of my University as GOD lifted me up, people began to see GOD in me. Slowly my thoughts shifted, I began to think that I was created to stand up for GOD, shine for GOD as a testimony for GOD. My Christian friends were also going through the same deliberation. As I was getting near to the finishing stages of my studies, it was very important to get a job before the end of my studies, that is what I thought or atleast everybody thought at that time. My friends said it is an absolute pity if we don&rsquo;t get a job before we finish. GOD blessed and gave many of my friends&rsquo; jobs before they completed their studies. We believed this was why GOD created us; to shine His light and stand as a testimony for Him.</p><p>Although I didn&rsquo;t get a job, GOD blessed me in a different way. GOD by His grace enabled me to continue my post graduate studies in a foreign land. Now the case takes a turn. Living in foreign country is considered equal to living in a paradise. But actually it is the opposite. There won&rsquo;t be anybody to take care; you have to do your own shopping, cooking, cleaning, washing etc. There is no mess or canteen who will cook all three meals of your day. Worse part is if you get sick, you have to deal with it alone. Your mum is 10000 miles away perhaps to make you a hot cup of kashayam(herbal drink). The loneliness will kill you. When someone goes through situations in life like this they are bound to have a different perspective in every aspect of life, leave alone GOD. You are exposed to a new dimension in life. As a Christian I began to trust GOD more for everything in life. Yes friends can help you but only up to an extent, the boundaries of friendship would change a lot with people from different countries. In my loneliness GOD helped me to understand Him more. He thought me more and every time when I walked through a tough situation, He helped me and carried me.</p><p>I came to understand GOD created us to have a relationship with us; to love us and to be loved by us. I learned, nothing else mattered in life. Did I have good parents? Did I go to a good school or was I able to get a good education. Did I get a job before everybody or before I finish College? Would I be able to find a good life partner? Would anybody love me? Would I be single and lonely all my life? I learnt, none of these things mattered. Now I understand the reason GOD created me was to love Him in my life on earth. Am I doing that right or am I getting distracted by the things of this world? Parents, education, Job, spouse, kids: none of these matter. </p><p>Every second of our lives we have to spend worshiping, praising GOD for His love. Asking for something and testifying is only a part of the Christian life. Answering our prayers is an easy task for GOD, in Ephesians 3:20 Paul says, &ldquo;God is able to do far more than we could ever ask for or imagine. He does everything by His power that is working in us&rdquo;. In Mathews 6:8 Jesus says GOD knows our wants even before we ask. Part of being a loving Father is to care for his children. What I learnt was the other things or blessings will come automatically. But do we love Him enough to sacrifice anything in our lives. I would say it is easier said than done. Jesus said, &ldquo;Love your GOD with all your heart, with all your love and with your entire mind, this is the first and the greatest commandment&rdquo;.</p><p>As we move on in our lives, we have to praise God for what all He has done and going to do in our lives. We should seek Him daily and we should walk according to His counsel. We should know Him more and grow in Him. Above all, we should love our God who created us. Do you really love Jesus Christ or do you run behind Him simply for worldly blessings?</p><p>Love God and Love your neighbour as you love yourself, because nothing else matters in this world as we live together. May God give you His grace to love Him more than anyone and anything. God bless you.</p><p> <strong>(Note: My dear young friends, The author who wrote this article does not want to reveal the identity and henceforth the name and the email id of the author was not published. Guest authors are always welcome in this blog and if you want to share your testimony or any article of yours, kindly send it to me at goldenhandsofgrace@gmail.com)</strong></p>",
    "articleAuthorId":0
  },
  {
    "articleId": 1,
    "articleTitle": "GUEST ARTICLE - 1 (YOU WILL RECEIVE GOD'S HOLY SPIRIT)",
    "date":"Dec 5,2019",
    "content": "<p>&ldquo;And whatever you ask in My name, that I will do, that the Father may be glorified in the Son.&rdquo; &ndash; JOHN 14:13</p><p>I would like to share one of my unforgettable and remarkable experiences which helped me to progress in the spiritual realm.</p><p>At the early days of my salvation, there was so little I knew about my savior Jesus Christ and there was no knowledge about holy spirit because I&rsquo;m from different background I don&rsquo;t have much opportunity to read or to listen word of God. But by the grace of God, he made me to pursue my degree course in a well reputed Christian university. There I came to know more about trinity God and anointing of Holy Spirit through word of God and also by listening to several preaching from various servants of God. Then I realized the significance of the anointing of Holy Spirit which help us to lead a spirit filled life that pleases God which will also pave way for tasting the love of God and transform us into His likeness everyday. So I was very much longing to receive the anointing of God not only that I also had seen the gifts of Holy Spirit operating in the life of young people who are of my age group. I wondered how they could be so close to God, witnessing and demonstrating the power of God through their lives. I also wondered how amazingly God uses them in His ministry to reveal His glory and power through their lives which brings salvation to many souls.</p><p>I was even more determined to ask God to fill me with anointing of Holy Spirit with in the end of a particular month because my life seems to be very meaningless without knowing the will and purpose of God in my life and my heart was filled with sense of hopelessness with much burden, agonizing and despairing over my future. It became increasingly obvious that there was only way out of my grief and meaningless existences is to get closer with living God which is possible only through receiving Holy Spirit&rsquo;s anointing so each day I waited in God&rsquo;s presence to receive His anointing and days rolled by and reached last day of that month and it was Sunday. So I still expecting God will somehow fill me in any of the service and fortunately, at that morning three of my dear ones and me gather together for a time of prayer. During prayer time except me all other were praying tongues and prophesying God&rsquo;s blessing upon our life and God began to reveal His plans for us and for our families through them and I was deeply depressed instead of being happy to hear all those wonderful promises and plans of God in my life because I was very much troubled and worrying about unanswered prayer of mine and I was questioning myself that why me alone couldn&rsquo;t experience the literal touch of God and I&rsquo;m thinking that I&rsquo;m may not me eligible or worthy enough to receive those gift and anointing of Holy Spirit.</p><p>It may be only for those who are predetermined by God but still my heart cries desperately to receive filling of holy spirit so that I too could walk close with my God. I was totally bewildered meanwhile one of them asked me to pray though I refused he compelled so I reluctantly made a short prayer because I couldn&rsquo;t even pray in that desolate condition. After that I said nothing to indicate to anyone what was on my mind but my Lord who knows my inner thoughts revealed my condition and also His passion and burden to fill me with His spirit to one of them. So they joined with me to ask God for me with much burden and Lord lead me to repent and confess all my sins and waited in the presence of Lord earnestly. Whole day I was anticipating for the touch of lord but nothing was happened so I was broken and frustrated but my dear ones are still encouraging me and asked me to wait upon the Lord and God revealed to one of them that tell my daughter to wrestle with me like Jacob for this blessing.</p><p>When it was almost 11&rsquo;O clock at night, I went alone to prayer hall and I cried inconsolably, my sobbing echoed down the prayer hall and I prayed, &ldquo;Lord either fill me with your Holy Spirit or take away my life I don&rsquo;t want to live without your anointing&rdquo;. Suddenly before clock strikes 12 without my knowledge my tongue started to twist and was uttering an unknown language and I felt powerful touch of God which bought greatest joy in my heart and all my sorrow was vanished. I also felt very hot all over body and Lord&rsquo;s presence was immense at that night so I was been uncontrollably shaken by immeasurable filling of Holy Spirit.</p><p>From that day on I could able to have an intimate relationship with my loving Father than ever before and the knowledge about Holy Spirit from the word of God was the reason which made me to have unquenchable thirst, heart of longings and desperate for anointing of Lord in my life. Bible says when the spirit of Lord Rest upon us we shall receive wisdom, understanding, knowledge, counsel, might and fear of the Lord. This will help us to build our life on Rock called Jesus Christ. More over bible says Holy Spirit will teach us all things and bring to our remembrances all things that Jesus said (John14:26). When Holy Spirit has come upon us we shall receive power and we will be witness (Acts 1:8) and most important thing is that He bears witness with our spirit that we are children of God (Rom8:16) and also helps us in our weakness for we don&rsquo;t know what we should pray for as we ought, but Spirit Himself makes intercession for us with groaning which cannot be uttered and he makes intercession for us according to the will of God (Rom 8:26, 27)</p><p>Bible says in Joel 2:28,27 and Acts 2:17,18 And it shall come to pass in the last days, says God, That I will pour out of My Spirit on all flesh; Your sons and your daughters shall prophesy, Your young men shall see visions, Your old men shall dream dreams. And on My menservants and on My maidservants I will pour out My Spirit in those days; and they shall prophesy.</p><p>According to above verse our Lord is ready to pour out His spirit upon us. Are you ready to ask for Lord&rsquo;s anointing in the name of Jesus Christ and receive that your joy may be full (John 16:24).If you ask God earnestly for the anointing of His Holy Spirit, surely He will pour out His anointing upon you for He is a faithful God who fulfills His promises. Ask and it shall be given to you.</p><p></strong>(Note: My dear young friends, The author who submitted this article does not want to reveal the identity and henceforth the name and the email id of the author was not published. Guest authors are always welcome in this blog and if you want to share your testimony or any article of yours, kindly send it to me at narainpons@gmail.com. God bless you.)</strong></p>",
    "articleAuthorId":0
  }
]